export const Terms = (titleText) => (
  <div className='terms-wrapper'>
    <div className='title-text'>Правила пользования</div>
    <ol>
      <li className='firstlevel'>
        Идейные соображения высшего порядка, а также высокое качество позиционных исследований представляет собой
        интересный эксперимент проверки экспериментов, поражающих по своей масштабности и грандиозности.
        <ol>
          <li>
            Идейные соображения высшего порядка, а также высокое качество позиционных исследований представляет собой
            интересный эксперимент проверки экспериментов, поражающих по своей масштабности и грандиозности.
          </li>
          <li>
            Идейные соображения высшего порядка, а также высокое качество позиционных исследований представляет собой
            интересный эксперимент проверки экспериментов, поражающих по своей масштабности и грандиозности.
          </li>
          <li>
            Идейные соображения высшего порядка, а также высокое качество позиционных исследований представляет собой
            интересный эксперимент проверки экспериментов, поражающих по своей масштабности и грандиозности.
          </li>
          <li>
            Идейные соображения высшего порядка, а также высокое качество позиционных исследований представляет собой
            интересный эксперимент проверки экспериментов, поражающих по своей масштабности и грандиозности.
          </li>
        </ol>
      </li>

      {/* 2 пункт */}
      <li className='firstlevel'>
        С учётом сложившейся международной обстановки, консультация с широким активом предоставляет широкие возможности
        для приоритизации разума над эмоциями.
        <ol>
          <li>
            С учётом сложившейся международной обстановки, консультация с широким активом предоставляет широкие
            возможности для приоритизации разума над эмоциями.
            <ol>
              <li>
                {' '}
                С учётом сложившейся международной обстановки, консультация с широким активом предоставляет широкие
                возможности для приоритизации разума над эмоциями.
              </li>
              <li>
                {' '}
                С учётом сложившейся международной обстановки, консультация с широким активом предоставляет широкие
                возможности для приоритизации разума над эмоциями.
              </li>
            </ol>
          </li>

          <li>
            {' '}
            С учётом сложившейся международной обстановки, консультация с широким активом предоставляет широкие
            возможности для приоритизации разума над эмоциями.
          </li>
        </ol>
      </li>

      {/* 3 пункт */}
      <li className='firstlevel'>
        Принимая во внимание показатели успешности, укрепление и развитие внутренней структуры требует от нас анализа
        приоритизации разума над эмоциями.
        <ol>
          <li>
            Принимая во внимание показатели успешности, укрепление и развитие внутренней структуры требует от нас
            анализа приоритизации разума над эмоциями.
            <ol>
              <li>
                Принимая во внимание показатели успешности, укрепление и развитие внутренней структуры требует от нас
                анализа приоритизации разума над эмоциями.
              </li>
              <li>
                Принимая во внимание показатели успешности, укрепление и развитие внутренней структуры требует от нас
                анализа приоритизации разума над эмоциями.
              </li>
            </ol>
          </li>
          <li>
            Принимая во внимание показатели успешности, укрепление и развитие внутренней структуры требует от нас
            анализа приоритизации разума над эмоциями.
          </li>
          <li>
            С учётом сложившейся международной обстановки, консультация с широким активом предоставляет широкие
            возможности для приоритизации разума над эмоциями.
            <ol>
              <li>
                С учётом сложившейся международной обстановки, консультация с широким активом предоставляет широкие
                возможности для приоритизации разума над эмоциями.
                <ol>
                  <li>
                    С учётом сложившейся международной обстановки, консультация с широким активом предоставляет широкие
                    возможности для приоритизации разума над эмоциями.
                  </li>
                  <li>
                    С учётом сложившейся международной обстановки, консультация с широким активом предоставляет широкие
                    возможности для приоритизации разума над эмоциями.
                  </li>
                </ol>
              </li>
            </ol>
          </li>
          <li>
            С учётом сложившейся международной обстановки, консультация с широким активом предоставляет широкие
            возможности для приоритизации разума над эмоциями.
          </li>
        </ol>
      </li>
    </ol>
  </div>
);
